#+title: Modeling - Framework and Falling Penny myth
#+startup: overview hideblocks indent inlineimages
#+property: header-args:R :results output :noweb yes
#+property: header-args:python :results output :noweb yes
#+options: toc:1 num:1
* Computation in Python

Create a variable ~a~ to represent acceleration in meters per second
squared:
#+begin_src python :results silent
  a = 9.8
#+end_src
Create another variable to represent the time for the penny to drop,
let's say 3.4 seconds:
#+begin_src python results silent
  t = 3.4
#+end_src
Now we can compute the velocity ~v~ of the penny after ~t~ seconds
(ignoring air resistance):
#+begin_src python
  v = a * t
  print(v)
#+end_src

#+RESULTS:
: 33.32

What distance ~x~ would the penny travel during that time?
#+begin_src python
  x = a * t**2 / 2
  print(x)
#+end_src

#+RESULTS:
: 56.644

How long would it take for the penny to fall 381 m, the height of the
Empire States building? First, let's store the height in a variable ~h~:
#+begin_src python :results silent
  h = 381
#+end_src

To compute t, we need the square root function. We can import the
function from the NumPy package:
#+begin_src python :results silent
  from numpy import sqrt
#+end_src

Now we can use it to compute ~t~ in seconds:
#+begin_src python
  t = sqrt(2 * h / a)
  print(t)
#+end_src

#+RESULTS:
: 8.817885349720552

Finally, let's calculate the penny's velocity ~v~ in m/s:
#+begin_src python
  v = a * t
  print(v)
#+end_src

#+RESULTS:
: 86.41527642726142

*Exercise:* can you compute the terminal velocity for the penny given
this formula:
\begin{equation}
 V_t = \sqrt{\frac{2 \cdot m \cdot g}{C_d \cdot A \cdot \rho}}
\end{equation}

Where $m$ is the mass of the object ($2.5\times 10^{-3} kg$), $g$ is
the acceleration due to gravity ($9.8 m/s^2$), $C_d$ is the drag
coefficient ($0.47$), A is the cross-sectional area of the object
($2.85\times 10^{-4} m^2$ - a penny has a radius of $9.525 mm$), and
$\rho$ is the density of the fluid through which the object is falling
($1.204 kg/m^3$).

Solution:
#+begin_src python
  # Assign constants
  m = 2.5e-3  # kg
  g = 9.8     # m/s^2
  c_d = 0.47    
  A = 2.85e-4 # m^2
  rho = 1.204

  # Compute terminal velocity
  v = sqrt((2 * m * g) / (c_d * A * rho))
  print(v)
#+end_src

#+RESULTS:
: 17.430644182450333

*Exercise*: check the penny area computation computationally.

*Solution:* we need the constant value for $\pi$, or we could
approximate it to 3.14, and the known area formula ($\pi r^2$):
#+begin_src python
  r = 9.525e-3
  A = r**2 * 3.14
  print(A)
  print(f'{round(A*1e4,2):.2f}')
#+end_src

#+RESULTS:
: 0.0002848784625
: 2.85

Let's do it with a higher precision ~pi~ using ~NumPy~:
#+begin_src python
  from numpy import pi
  A = r**2 * pi
  print(A)
  print(f'{round(A*1e4,2):.2f}')  
#+end_src

#+RESULTS:
: 0.0002850229569923425
: 2.85

* Computation with Units

When we set ~h = 381~ and ~a = 9.81~, we left out the units. This can be
expensive, as the loss of the Mars Climate Orbiter in 1998 at a total
price of several hundred million dollars: different software computed
the thrust in different units leading to the loss of the orbiter in
the Mars atmosphere.

To represent units, we us the ~Pint~ library ([[https://pint.readthedocs.io/en/stable/][doc]]) and initialize a
~UnitRegistry()~ object. Without parameters, it contains a [[https://github.com/hgrecco/pint/blob/master/pint/default_en.txt][default list]]
of units and prefixes.
#+name: units
#+begin_src python
  from pint import UnitRegistry
  units = UnitRegistry()
#+end_src

In DataCamp workspace, ~pint~ is not installed. Go to the Environment
tab to search for it, and then you're offered to ~Add to notebook~. The
installation will be added as a cell at the top of the notebook.

The object ~units~ contains pretty much every unit you've ever heard of:
#+begin_src python
  <<units>>
  print(units.leagues)
  print(units.fortnight)
#+end_src

#+RESULTS:
: league
: fortnight

You can list all units - how many are there altogether?
#+begin_example python
  len(list(units._units.keys())) # output: 953
  #+end_example

More importantly, Pint contains standard [[https://www.nist.gov/pml/owm/metric-si/si-units][SI units]] (International
System of Units) like meter and second:
#+name: meter_second
#+begin_src python
  <<units>>
  meter = units.meter
  second = units.second
  print(meter, second)
#+end_src

#+RESULTS: meter_second
: meter second

We can use ~meter~ and ~second~ to create a variable ~a~ and give it the
value of acceleration due to gravity:
#+begin_src python
  a = 9.8 * meter / second**2
  print(a)
#+end_src

#+RESULTS:
: 9.8 meter / second ** 2

The object ~a~ is a quantity with two parts, ~magnitude~ and ~units~:
#+begin_src python
  print(a.magnitude)
  print(a.units)
#+end_src

#+RESULTS:
: 9.8
: meter / second ** 2

Create a quantity that represents 3.4s:
#+begin_src python
  t = 3.4 * second
  print(t)
#+end_src

#+RESULTS:
: 3.4 second

Compute the distance a penny would fall after ~t~ seconds with constant
acceleration ~a~:
#+begin_src python
  print(a * t**2 / 2)
#+end_src

#+RESULTS:
: 56.644 meter

If we create a quantity to represent the height of the Empire State
Building ~h~, we can compute the time the penny would take to reach the
sidewalk:
#+begin_src python
  from numpy import sqrt
  h = 381 * meter
  t = sqrt(2 * h / a)
  print(t)
#+end_src

#+RESULTS:
: 8.817885349720552 second

And finally the velocity of the penny on impact:
#+begin_src python
  v = a * t
  print(v)
#+end_src

#+RESULTS:
: 86.41527642726142 meter / second

If we want to convert this to imperial (US) units, we establish ~mile~
and ~hour~:
#+begin_src python
  mile = units.mile
  hour = units.hour

  print(v.to(mile/hour))
#+end_src

#+RESULTS:
: 193.30546802805432 mile / hour

To get help on the ~to~ function you can just enter ~v.to~ but the help is
highly obscure - typical Python. The online documentation might be
more useful:
#+begin_src python
  help(v.to)
#+end_src

#+RESULTS:
#+begin_example
Help on method to in module pint.facets.plain.quantity:

to(other: 'Optional[QuantityOrUnitLike]' = None, *contexts, **ctx_kwargs) -> 'PlainQuantity' method of pint.Quantity instance
    Return PlainQuantity rescaled to different units.
    
    Parameters
    ----------
    other : pint.PlainQuantity, str or dict
        destination units. (Default value = None)
    ,*contexts : str or pint.Context
        Contexts to use in the transformation.
    ,**ctx_kwargs :
        Values for the Context/s
    
    Returns
    -------
    pint.PlainQuantity
#+end_example

